performance/scenarios/http-scenario.yml
config:
  target: "http://localhost:3001"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 10
      arrivalRate: 10
  variables:
    file:
      - "../../../resources/10MB.bin"
      - "../../../resources/20MB.bin"
      - "../../../resources/1MB.zip"
  processor: 
    '../utils/builders/http.js'

before:
  engine: http
  flow:
    - function: "deleteResults"
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
after:
  engine: http
  flow:
    - function: "clearIntervals"
scenarios:
  - name: 'Sending messages'
    engine: http
    flow:
      - function: "setMessage"
  - name: "Testing files"
    engine: http
    flow:
      - function: "testImages"