performance/scenarios/http-scenario.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 10
      arrivalRate: 1
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
scenarios:
  - flow:
    - loop:
      - get:
          url: '/'
      - post:
          url: '/'
          json:
            message: 'hello'
      count: 10