performance/scenarios/websocket-scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 10
  variables:
    file:
      - "../../resources/10MB.bin"
      - "../../resources/20MB.bin"
      - "../../resources/civic_renewal_forms.zip"
  socketio:
    transports: ["websocket"]
  processor: 
    '../utils/builder.js'

scenarios:
  - name: 'Image Sending'
    engine: socketio
    flow:
      - function: "setImage"
  - name: 'My sample scenario text'
    engine: socketio
    flow:
      - function: "setMessage"