performance/scenarios/websocket-scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 10
  variables:
    file:
      - "../../../resources/10MB.bin"
      - "../../../resources/20MB.bin"
      - "../../../resources/1MB.zip"
  socketio:
    transports: ["websocket"]
  processor: 
    '../utils/builders/websocket.js'

before:
  engine: socketio
  flow:
    - function: "deleteResults"

scenarios:
  - name: 'Image Sending'
    engine: socketio
    flow:
      - function: "setImage"
  - name: 'My sample scenario text'
    engine: socketio
    flow:
      - function: "setMessage"